!function() {
	var citys = [
			

			{
				"n" : "广东",
				"c" : [
						{
							"a" : [ "天河区", "海珠区", "荔湾区", "越秀区", "番禺区", "花都区",
									"萝岗区", "白云区", "南沙区", "黄埔区", "增城区", "从化区",
									"广州大学城" ],
							"n" : "广州市"
						},
						{
							"a" : [ "罗湖区", "福田区", "南山区", "宝安区", "光明新区", "龙岗区",
									"坪山新区", "盐田区", "龙华新区", "大鹏新区" ],
							"n" : "深圳市"
						},
						{
							"a" : [ "斗门区", "金湾区", "香洲区" ],
							"n" : "珠海市"
						},
						{
							"a" : [ "龙湖区", "金平区", "澄海区", "潮阳区", "潮南区", "濠江区",
									"南澳县" ],
							"n" : "汕头市"
						},
						{
							"a" : [ "武江区", "浈江区", "南雄市", "乐昌市", "仁化县", "始兴县",
									"翁源县", "新丰县", "乳源瑶族自治县", "曲江区" ],
							"n" : "韶关市"
						},
						{
							"a" : [ "和平县", "龙川县", "紫金县", "连平县", "源城区", "东源县" ],
							"n" : "河源市"
						},
						{
							"a" : [ "梅江区", "兴宁市", "梅县", "蕉岭县", "大埔县", "丰顺县",
									"五华县", "平远县" ],
							"n" : "梅州市"
						},
						{
							"a" : [ "惠阳区", "大亚湾区", "惠城区", "惠东县", "博罗县", "龙门县" ],
							"n" : "惠州市"
						},
						{
							"a" : [ "城区", "陆丰市", "陆河县", "海丰县" ],
							"n" : "汕尾市"
						},
						{
							"a" : [ "长安镇", "莞城区", "南城区", "寮步镇", "大岭山镇", "横沥镇",
									"常平镇", "厚街镇", "万江区", "樟木头镇", "塘厦镇", "凤岗镇",
									"大朗镇", "东坑镇", "清溪镇", "企石镇", "茶山镇", "东城区",
									"虎门镇", "黄江镇", "石排镇", "道滘镇", "沙田镇", "高埗镇",
									"石龙镇", "石碣镇", "洪梅镇", "麻涌镇", "松山湖", "桥头镇",
									"望牛墩镇", "中堂镇", "谢岗镇" ],
							"n" : "东莞市"
						},
						{
							"a" : [ "城区", "火炬开发区", "小榄镇", "古镇", "三乡镇", "民众镇",
									"东凤镇", "板芙镇", "神湾镇", "横栏镇", "港口镇", "三角镇",
									"大涌镇", "南头镇", "沙溪镇", "坦洲镇", "黄圃镇", "五桂山镇",
									"南朗镇", "沙朗镇", "阜沙镇", "东升镇" ],
							"n" : "中山市"
						},
						{
							"a" : [ "台山市", "新会区", "鹤山市", "江海区", "蓬江区", "开平市",
									"恩平市" ],
							"n" : "江门市"
						},
						{
							"a" : [ "顺德区", "禅城区", "高明区", "三水区", "南海区" ],
							"n" : "佛山市"
						},
						{
							"a" : [ "江城区", "阳东县", "阳春市", "阳西县" ],
							"n" : "阳江市"
						},
						{
							"a" : [ "赤坎区", "霞山区", "经济技术开发区", "麻章区", "遂溪县",
									"廉江市", "坡头区", "雷州市", "吴川市", "徐闻县" ],
							"n" : "湛江市"
						},
						{
							"a" : [ "茂南区", "电白县", "高州市", "化州市", "茂港区", "信宜市" ],
							"n" : "茂名市"
						},
						{
							"a" : [ "端州区", "四会市", "高要市", "广宁县", "德庆县", "怀集县",
									"封开县", "鼎湖区" ],
							"n" : "肇庆市"
						},
						{
							"a" : [ "云城区", "罗定市", "云安县", "新兴县", "郁南县" ],
							"n" : "云浮市"
						},
						{
							"a" : [ "连州市", "佛冈县", "阳山县", "清新县", "连山县", "连南县",
									"清城区", "英德市" ],
							"n" : "清远市"
						}, {
							"a" : [ "湘桥区", "枫溪区", "潮安区", "饶平县" ],
							"n" : "潮州市"
						}, {
							"a" : [ "东山区", "普宁市", "榕城区", "揭东县", "揭西县", "惠来县" ],
							"n" : "揭阳市"
						} ]
			}
		];
	if (typeof define === "function") {
		define(citys)
	} else {
		window.YDUI_CITYS = citys
	}
}();